---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.PathOfTravelFailures.UpdateSummary
source: html/6201a551-609e-d5dc-0b21-2d07969f0ef3.htm
---
# Autodesk.Revit.DB.BuiltInFailures.PathOfTravelFailures.UpdateSummary Property

[Number] Path of Travel lines successfully updated.
 [Number] Path of Travel lines failed to update.

## Syntax (C#)
```csharp
public static FailureDefinitionId UpdateSummary { get; }
```